<?php

/**
 * This file is an error description file.
 *
 * All errors in the system will be described here
 * The returned content is processed through the multilingual module
 */

return [
    0 => '成功',

    800001 => '查询太过频繁嗷～慢一点',
    800002 => '密码不对，再想想',
    800003 => '登录过期嗷，重新登录一下吧',
    800004 => '登录过期嗷，重新登录一下吧',
    800005 => 'uid查询失败，建议联系主包',
    800006 => '别看了，商品下架了，看点别的',
    800007 => '不是，咋回事啊老弟，你这积分不够啊',
    800008 => '款式异常，重新去选一遍喜欢的款式吧',
    800009 => '日期异常，你肯定没好好写日期',
    800010 => '？别闹',
    800011 => '仍有信息未完善，需完善商品信息',
    800012 => '这个用户已经存在啦，不准添加！',
    800013 => '不对劲，没找到这个数据，肯定不对劲',
    800014 => '投诉记录不存在',
    800015 => '投诉ID不能为空',

    900001 => '咋回事啊老弟',
    900002 => '咋回事啊老弟',
    900003 => '咋回事啊老弟',
    900004 => '咋回事啊老弟',
    900005 => '登录信息挂载失败',
    900006 => '登录过期嗷，重新登录一下吧',
    900007 => '构建失败，请联系作者进行处理！',
];
